Revit 2027 API
StairsComponentConnection.PeerConnectionType Property
 The connection type of the peer connected stairs component.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StairsComponentConnectionEndType PeerConnectionType { get; }
Public ReadOnly Property PeerConnectionType As StairsComponentConnectionEndType
	Get
public:
property StairsComponentConnectionEndType PeerConnectionType {
	StairsComponentConnectionEndType get ();
}
member PeerConnectionType : StairsComponentConnectionEndType with get
Property Value
StairsComponentConnectionEndType
See Also
Reference
StairsComponentConnection Class
Autodesk.Revit.DB.Architecture Namespace